{
  "title": "5 clever ways to learn new words",
  "subtitle": "Improve your vocabulary with these tricks",
  "slug": "learn-new-words-improve-vocabulary",
  "section": "words",
  "url": "/words/learn-new-words-improve-vocabulary/",
  "body": "The English language is vast, so whether we know it or not, we’re all on a sort-of quest to learn new words. If you’re keen to improve your vocabulary and learn new words, employ some of these top tips. \r\n\r\n##1. Read more / different things\r\nA sure-fire way to increase your vocabulary and expose yourself to new words is through reading. Ultimately, it doesn’t really matter what you read - it could be news websites, papers, magazines or novels - most literature will be able to teach you something. \r\n\r\nIf you’re already a keen reader, then try something different. If you love a particular genre of book, perhaps delve into something you’d never usually choose. It’s likely that a new genre, or new publication, will have a few new words to throw at you and you’ll pick them up in no time using our personal dictionary app. \r\n\r\n##2. Buy a thesuarus\r\nThis might be the obvious option, but much like physical exercise, your brain needs training in order to learn new words. Buy a thesaurus and endeavour to learn one new word a day. When you wake up, open it at a random page and pick a word. Read the definition, and throughout the day try to test yourself, or even to use it in an email, text or conversation.\r\n\r\nThe more you interact with new words, the more you’ll learn. \r\n\r\n##3. Play addictive games like words with friends\r\nThere are plenty of word games out there (we’re particular fans of Scrabble and Bananagrams), but we reckon one of the best games to learn new words is online: Words with Friends. \r\n\r\nThere have been stories on of Words with Friends fans striking up long-lasting, rewarding relationships [link] as a result of this game, but on a basic level it creates a brilliant opportunity to learn new words. It’s available on Android and iOS, can be played pretty much anywhere, against friends, strangers or the computer. \r\n\r\n[explain how it works]\r\n\r\n[other word games in gifts round-up link]\r\n\r\n##4. Use Oh My Word! \r\nThe best way to keep on top of all these new words you’re learning is with our personal dictionary app. Sign up to Oh My Word! and you’ll get access to your own personal dictionary. You’ll be able to save words you find as you’re browsing the internet using our Chrome extension [link], and see them all together in a list - definitions and all.\r\n",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-12-15T21:26:08.903Z",
  "updated": "",
  "published": "",
  "contentType": "page",
  "id": "B1KlR2ZGz"
}