{
  "title": "Great foreign words we should all adopt",
  "subtitle": "",
  "slug": "foreign-words-we-should-use-in-english",
  "section": "words",
  "url": "/words/foreign-words-we-should-use-in-english/",
  "body": "In English there are hundreds of words to describe hundreds of feelings, scenes and settings, but we don't always have that _just right_ word. Sometimes you want a single term that will hit the spot.\r\n\r\nBelow are a few foreign words which do just that. Enjoy dropping these into everyday conversation...\r\n\r\n## 1. Hygge\r\nThis is a wonderful Danish word and it refers to a lifestyle we should all endeavour to lead. _Hygge_ means creating a warm atmosphere and enjoying the good things in life with good people. This could mean a cup of tea by the fire on a cosy sofa with your cat if you're an [ailurophile](https://en.oxforddictionaries.com/definition/ailurophile), or perhaps a feast of your favourite foods with family and friends.\r\n\r\n## 2. Kummerspeck\r\nIt's not as filthy as it sounds, we swear. _Kummerspeck_ is actually a German word for weight we gain from comfort eating. It could well be something you can refer to once you've had your fill of _hygge_ (see above).\r\n\r\n## 3. Iktsuarpok\r\nWe've all been there: your friend or partner on their way to your house and you know they're due any minute. You're so anxious about their arrival and potentially missing the doorbell ring that you keep going out to check. That's _iktsuarpok_. Thanks to Inuits, for this little gem.\r\n\r\n## 4. Gigil\r\nCute aggression: it's a thing. It's that bursting feeling you get when you see a fluffy kitten sleeping or spring lamb bounding through green fields. There's so much excitement, you actually feel a little bit violent. In Filipino, this urge to pinch or squeeze something cute is called _gigil_.\r\n\r\n## 5. L’esprit de l’escalier\r\nIn French, this literally translates to 'stairwell wit'. But it refers to that witty retort you thought of when it was too late. We've all suffered with l’esprit de l’escalier.\r\n\r\n## 6. Pelinti\r\nHow there isn't a word for this in English already, we don't know. You know when you're too excited to tuck into your dinner so you dive straight in, but it's piping hot so you have to tilt your head back, breathe through it and move it around your mouth? That, my friends, is what the Ghanaians call _pelinti_.\r\n\r\n## 7. Komorebi\r\nThis rather beautiful little word refers to the sunlight that filters through trees in Japanese.\r\n\r\n## 8. Pana po’oing\r\nThis is what we do when we walk into a room then forget what we came in for. That confused, head-scratching action is called – in Hawaiian – _pana po’oing_.\r\n\r\n## 9. Seigneur-terraces\r\nIn the age of the freelancer, we all know a few of these (and have probably been guilty of it ourselves, too). _Seigneur-terraces_, in French, refers to someone who sits in a coffee shop for a long time but spends little money.\r\n\r\n## 10. Boketto\r\nThis action, _boketto_, is something we've all done – and probably quite frequently. We're glad the Japanese have given staring into the distance at nothing a name.\r\n\r\n## 11. Zeg\r\nThis handy little word could save us all some breath: it's Georgian for the day after tomorrow. We wonder if that's what the movie was called over there...\r\n\r\n## 12. Tsundoku\r\nWe're beginning to think the Japanese have a word for everything. This one's a term for the act of buying a book and not reading it. Come on, we've all done it...\r\n\r\n## 13. Voorpret\r\nPre-party excitement, that's what this is. _Voorpret_, in Dutch, is the feeling of enjoyment before an event takes place.\r\n\r\n## 15. Dépaysement\r\nSome of us enjoy this feeling, but others dread it: _dépaysement_, in French, is that sense of disorientation when in a foreign country or culture.\r\n\r\n## 16. Fernweh\r\nWhen wanderlust doesn't cut it, use fernweh. This lovely little German term is not just the desire to travel, but the need.\r\n\r\n## 17. Lagom\r\nNot too much, not too little – _lagom_ is just the right amount (in Swedish).\r\n\r\n## 18. Utepils\r\nFor a country with so few hours of daily sunlight daily, this is something Norwegians cherish so much they made a word for it. _Utepils_ is the act of sitting outside to enjoy a beer on a sunny day.\r\n\r\n_If you're a lover of the English language, you need [our Chrome extension](https://chrome.google.com/webstore/detail/oh-my-word/ehcalenbnkfmddlonpfaoacalanaiide) and [Android App](https://play.google.com/store/apps/details?id=xyz.ohmyword.app) so you can start logging your favourite words to your own personal dictionary._",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-15T07:34:01.721Z",
  "updated": "2017-08-15T09:30:59.624Z",
  "published": "",
  "contentType": "page",
  "id": "B1zgVmxOb"
}