{
  "title": "Wine words: discovering the languages of Sussex, England",
  "subtitle": "",
  "slug": "sussex-language",
  "section": "",
  "url": "/sussex-language/",
  "body": "It was serendipity that I settled in with my laptop at the gorgeous Flint Barns – getting to work on the Oh My Word! mobile app – and found on the bookshelves next to me three rather intriguing books.\r\n\r\nThe first was the rather apt [_LexiWine_](http://www.lexivin.com/page_thecollection.html), an English-French dictionary of all the wine terms you could possibly need while staying on a vineyard like the [Rathfinny Estate](http://rathfinnyestate.com/).\r\n\r\nThe second was a fifty-year-old thesaurus, the [_Everyman's Thesaurus of English Words and Phrases_](https://www.amazon.co.uk/Everymans-thesaurus-English-phrases-library/dp/B0000CIBUO) by Peter Roget (and edited by D.C. Browning), which, on the surface, doesn't sound so unusual. But this thesaurus isn't your standard A-Z of alternative words.\r\n\r\nThis collection of terms is instead organised by theme, for example, words related to matter all appear in one section (like density, brittleness and air), and there's an entire chapter dedicated to 'words relating to the voluntary powers', full of terms like willingness, habit and obstinacy.\r\n\r\nThis is perhaps a sign of changing times and the way we interact with language. The Everyman's Thesaurus is a book to be pored over, to be picked up and read and inspired by. It's not just a reference book, but a stimulus for writers and logophiles. It's a pleasure to flick through.\r\n\r\nToday's common thesaurus would usually be ordered alphabetically – making it more of a quick reference tool that can be put down as quickly as it's picked up.\r\n\r\nThe third book I found, however, was by far the most interesting: [_A dictionary of the Sussex dialect_](https://www.amazon.co.uk/Dictionary-The-Sussex-Dialect-Guide/dp/1906022151). Initially, I expected it to be something of a satirical commentary on the careless use of the English language in rural Sussex, but on closer inspection I found that it's a fascinating investigation into a collection of dying words used in specific areas of this stunning countryside.\r\n\r\nWritten and compiled by the Reverend W.D. Parish, vicar of Selmeston and self-made lexicographer, and first published in 1875, it's a wonderful volume preserving lost words of a now strange and unfamiliar dialect. In his eloquent introduction, he writes:\r\n\r\n> _In almost every establishment in the country there is to be found some old groom, or gardener, bailiff, or factotum, whose odd expressions and quaint sayings and apparently outlandish words afford a never-failing source of amusement to the older as well as to the younger members of the household, who are not aware that many of the words and expressions which raise the laugh are purer specimens of the English language than the words which are used to tell the story in which they are introduced._\r\n\r\nHe justifies his peculiar pastime like this:\r\n\r\n> _The fact that I have lived for several years in a village spelled Selmeston and pronounced Simpson; within reach of Brighthelmston, pronounced Brighton, and next to the village of Chalvington, called Charnton, will, I think, be considered sufficient excuse for the direction my studies have taken._\r\n\r\nSo throughout this work you glean another perspective of the history of one of England's most beautiful and perplexing counties. Below are a few interesting terms we found, glass of wine in hand, while reading this book in the lounge of the lovely Flint Barns.\r\n\r\n**Flappers**: in rural Sussex these aren't young women wearing tassles and feathers, but instead young wild ducks that have just taken to the wing but are unable to fly.\r\n\r\n**Horn-fair**: Rough music with frying pans, horns &c., generally reserved for persons whose matrimonial difficulties have attracted the attention of their neighbours.\r\n\r\n**Hurley-Bulloo**: A disturbance.\r\n\r\n**Ichon'em**: each one of them.\r\n\r\n**A Husser-and-Squencher**: A pot of beer with a dram of gin in it.\r\n\r\n**Messengers**: Large white flying clouds, indicating rough weather.\r\n\r\n**Mistus**: It is the usual pronunciation of mistress. It is very difficult to say at what age a Sussex man's wife ceases to be his mistus and becomes the old 'ooman, and finally lapses (probably in her second childhood) into the old gal.\r\n\r\n**Skrow**: Surly; ill-tempered.\r\n\r\n**Slirrup**: To lap up any liquid noisily.\r\n\r\n**Twort**: To be pert and saucy.\r\n\r\n**Yoyster**: To play about roughly and noisily.\r\n\r\n_If you're a lover of the English language, you need [our Chrome extension](https://chrome.google.com/webstore/detail/oh-my-word/ehcalenbnkfmddlonpfaoacalanaiide) and [Android App](https://play.google.com/store/apps/details?id=xyz.ohmyword.app) so you can start logging your favourite words to your own personal dictionary._",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-14T14:32:40.900Z",
  "updated": "2017-08-14T14:36:58.009Z",
  "published": "2017-08-14T14:36:58.009Z",
  "contentType": "page",
  "id": "Bkb9EN1OW"
}