{
  "title": "The best new words added to the Oxford English Dictionary in 2015",
  "subtitle": "",
  "slug": "best-new-words-oxford-english-dictionary-2015",
  "section": "",
  "url": "/best-new-words-oxford-english-dictionary-2015/",
  "body": "In just the last three months of 2015 over 500 English words and phrases were added to the Oxford English Dictionary. Get with the times and develop your English vocabulary: here is our pick of the best new words in 2015.\r\n\r\n[Phablet](https://www.oxforddictionaries.com/definition/english/phablet)– A smartphone with a screen which is intermediate in size between that of a typical smartphone and a tablet computer.\r\n\r\n[Chiffonade](https://www.oxforddictionaries.com/definition/english/chiffonade) – A preparation of shredded or finely cut leaf vegetables, used as a garnish for soup.\r\n\r\n[Flotus](https://www.oxforddictionaries.com/definition/english/flotus) – an acronym for the First Lady of the United States.\r\n\r\n[Internaut](https://www.oxforddictionaries.com/definition/english/internaut) – A user of the Internet, especially a habitual or skilled one.\r\n\r\n[Pasalubong](https://www.oxforddictionaries.com/definition/english/pasalubong) – A gift or souvenir given to a friend or relative by a person who has returned from a trip or arrived for a visit.\r\n\r\n[Roastery](https://www.oxforddictionaries.com/definition/english/roastery) – A place where coffee beans are roasted or processed.\r\n\r\n[Sinigang](https://www.oxforddictionaries.com/definition/english/sinigang) – In Filipino cookery: a type of soup made with meat, shrimp, or fish and flavoured with a sour ingredient such as tamarind or guava.\r\n\r\n[Tenderpreneur](http://www.oxforddictionaries.com/definition/english/tenderpreneur) – A person who uses his or her political connections to secure government contracts and tenders for personal advantage.\r\n\r\n[Zef](http://www.oxforddictionaries.com/definition/english/zef) – Common; ‘trashy’.",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-14T12:09:17.673Z",
  "updated": "",
  "published": "",
  "contentType": "page",
  "id": "By8g7GkOZ"
}