{
  "title": "8 of the best apps for writers",
  "subtitle": "",
  "slug": "best-apps-for-writers",
  "section": "blog",
  "url": "/blog/best-apps-for-writers/",
  "body": "Writing has changed drastically over the last century. In the early 1900s, only 23 per cent of the world's population were literate. Today, there's an 83 per cent literacy rate across our globe thanks to wider access to education and advances in technology. While some will have started out using typewriters, today there's a whole host of tech that enhances our ability to communicate with the written word, and thanks to the rise of the internet and the smartphone, there's plenty of cool software too. Here are a few of the best applications for writers:\r\n\r\n## 1. Expand your vocabulary with Oh My Word!\r\nOf course we couldn't leave our own Chrome extension out. If your writing needs more variety, we're here to help. [Oh My Word!](https://chrome.google.com/webstore/detail/oh-my-word/ehcalenbnkfmddlonpfaoacalanaiide) (a Chrome extension – mobile app in progress) allows you to save your favourite words to your own personal dictionary.\r\nOh My Word!, available on Chrome store only (iOS and Android app in development) is free.\r\n\r\n## 2. Be a dictator with Dragon\r\nFor those of you who feel sitting in front of a screen is a hinderance to your creative writing, [Dragon](http://www.nuance.com/dragon/index.htm) saves the day. This piece of software, available in a variety of versions dependent on your needs, allows you to speak to your device, wherever you are, and the words will appear on the screen. No more will hours of working away bring headaches and the risk of RSI!\r\nDragon is available in a variety of versions and prices, from US $15.\r\n\r\n## 3. Keep your favourite writing in your Pocket\r\nA writer must write, write and write some more. That's the general rule. But you must also read – perhaps even more than you write. With [Pocket](https://getpocket.com/a/), you can save web articles and videos for reading later, even when you're offline.\r\nPocket is available for iOS and Android for free.\r\n\r\n## 4. Write from anywhere with Google Docs\r\nWe all probably feel like we're a bit of a slave to Google these days – but there's a good reason for that: they do make excellent technology. [Google Docs](https://www.google.com/docs/about/) is the perfect resource for anyone on the go a lot. You can write and edit on Google Docs from anywhere – as long as you've got a laptop, computer, tablet or smartphone to hand.\r\nGoogle Docs is free – but you must have a Google account (also free).\r\n\r\n## 5. Do everything with Evernote\r\n\"The workspace for your life's work\" is a pretty accurate description of what [Evernote](https://evernote.com/?var=c) is. It's a place to take and keep notes, write at length, collect, organise and present. It can be the hub of all your creativity if you so wish.\r\nEvernote is free, but you can pay for a premium service.\r\n\r\n## 6. Get rid of writer's block with the Brainstormer\r\nThis is a fun little app that's designed to get your creativity flowing. Spin the theoretical wheel and it'll randomly throw up a plot, subject and setting or style for you to start work on.\r\n[The Brainstormer](https://itunes.apple.com/gb/app/the-brainstormer/id374496865?mt=8) is available on iOS at US $1.99.\r\n\r\n## 7. Take a break with the Pomodoro Timer\r\nIf you're guilty of staring for hours at your computer screen without writing a single word, you might well [need this timer)[https://itunes.apple.com/us/app/pomodoro-timer-focus-on-your/id703145045?mt=8]. Not only does it schedule regular breaks to ensure your eyes don't go square, it purports to improve productivity. The (Pomodoro Technique)[http://pomodorotechnique.com/get-started/] is a time management system that works in 25-minute stints, and many people – not just writers – (swear by it](http://pomodorotechnique.com/testimonials/).\r\nThe Pomodoro Timer is available on iOS and Android for US $1.99.\r\n\r\n## 8. Be more creative with Coffitivity\r\nSometimes silence is the bane of all creatives, so most of us turn to music. But when music doesn't have the answer, or you can't decide which kind will help, [Coffitivity](https://coffitivity.com/) is the app (and website) to use. Rather than heading to your local Starbucks, you can bring the coffee shop to you with these atmospheric sounds from a generic café.\r\nCoffitivity is free online, and on iOS and Android.",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-14T12:11:38.518Z",
  "updated": "2017-08-14T12:11:44.472Z",
  "published": "2017-08-14T12:11:44.472Z",
  "contentType": "page",
  "id": "HJQK7GyOb"
}