{
  "title": "8 great books for logophiles",
  "subtitle": "",
  "slug": "great-books-for-logophiles",
  "section": "words",
  "url": "/words/great-books-for-logophiles/",
  "body": "In honour of [World Book Day](http://www.worldbookday.com/), we're rounded up the best books for people who love words. While it's not World Book Day anymore, we're still logophiles.\r\nSo if you're a lover of the English language, here are a few brilliant books you'll enjoy:\r\n\r\n## 1. For all things etymology\r\n[_The Etymologicon: A Circular Stroll through the Hidden Connections of the English Language_](https://www.amazon.co.uk/Etymologicon-Circular-through-Connections-Language/dp/1848313071/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=&sr=) by Mark Forsyth is brilliant. It begins with a study of the word books, or more specifically the phrase a turn up for the books, and from there explores how chickens are linked to gambling and that \"Alexander the Great conquered half the world without even a café latte to perk him up.\"\r\nForsyth has a number of other excellent word-nerd books, including [one about lost words](https://www.amazon.co.uk/Horologicon-Jaunt-Through-English-Language/dp/1848314159/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=&sr=) of the English language which is bound to expand your ever-elegant vocabulary.\r\n\r\n## 2. For endless collective nouns\r\nOkay so it's not endless, but there are over 1100 collective nouns in James Lipton's [_An Exaltation of Larks_](https://www.amazon.co.uk/Exaltation-Larks-James-Lipton/dp/0140170960).\r\n\r\n## 3. For next-level eloquence\r\nTry anything by Jane Austen. This literary lady is quoted more than 1600 times in the Oxford English Dictionary, and has made a variety of phrases part of our everyday language. [_She's the Queen of Words_](https://www.grammarly.com/blog/10-of-the-best-words-from-jane-austens-novels/), especially with her use of terms like 'panegyric' and 'counterpoise'.\r\n\r\n## 4. For sharp wit\r\nAlmost anything by Oscar Wilde will please a logophile, but this little book, [_Only Dull People are Brilliant at Breakfast_](https://www.penguin.co.uk/books/292318/only-dull-people-are-brilliant-at-breakfast/#DdG3E1mJhY9iXmei.99), containing \"witticisms on the dangers of sincerity, duplicitous biographers, and the stupidity of the English\" is perhaps the icing on the literary cake.\r\n\r\n## 5. For a history of English\r\n[_Mother Tongue: The Story of the English Language_](https://www.amazon.co.uk/Mother-Tongue-Story-English-Language/dp/0141040084/ref=sr_1_4?ie=UTF8&qid=1456855566&sr=8-4&keywords=history+of+language) by Bill Bryson is as funny and entertaining as his travel writing. This book takes you on a journey through the English language, examining its history from humble beginnings to one of the world's most widely-spoken languages.\r\n\r\n## 6. For interesting idioms\r\n[_Why You Say It_](https://www.amazon.co.uk/Why-You-Say-Fascinating-Everyday/dp/1595552995/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=&sr=) is much like the Etyomologicon, but focuses on English idioms instead of individual words. From beating around the bush, to tasting humble pie, this delightful read will educate and entertain.\r\n\r\n## 7. For grammar geeks\r\nPunctuation doesn't have to be boring, [_Eats Shoots & Leaves_](https://www.amazon.co.uk/Eats-Shoots-Leaves-Lynne-Truss/dp/0007329067/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=&sr=) is the perfect testament to that. Author Lynne Truss takes the reader on a tour of the rules of grammar and punctuation.\r\n\r\n## 8. For excellent expletives\r\nDid you know the word 'fuck' first appeared in the English language in the fifteenth century? Nor did we, until we read [_The F-Word_](https://www.amazon.co.uk/F-Word-Jesse-Sheidlower/dp/0571197302) – a novel by Jesse Sheidlower about one of the most-popular expletives, its origins and its many, often rather creative, uses.\r\n",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-07-23T13:16:39.412Z",
  "updated": "2017-08-14T14:27:24.415Z",
  "published": "2017-08-14T14:27:24.415Z",
  "contentType": "page",
  "id": "r1kTW7z8W"
}