{
  "title": "Privacy",
  "subtitle": "",
  "slug": "privacy",
  "section": "",
  "url": "/privacy/",
  "body": "### What is this Privacy Policy for?\r\n\r\nThis privacy policy is for this website\r\n[https://ohmyword.xyz](https://ohmyword.xyz) and served by Oh My Word!\r\nand governs the privacy of its users who choose to use it.\r\n\r\nThe policy sets out the different areas where user privacy is concerned\r\nand outlines the obligations & requirements of the users, the website\r\nand website owners. Furthermore the way this website processes, stores\r\nand protects user data and information will also be detailed within this\r\npolicy.\r\n\r\n### The Website\r\n\r\nThis website and its owners take a proactive approach to user privacy\r\nand ensure the necessary steps are taken to protect the privacy of its\r\nusers throughout their visiting experience. This website complies to all\r\nUK national laws and requirements for user privacy.\r\n\r\n### Use of Cookies\r\n\r\nThis website uses cookies to better the users’ experience while visiting\r\nthe website. Where applicable this website uses a cookie control system\r\nallowing the user on their first visit to the website to allow or\r\ndisallow the use of cookies on their computer / device. This complies\r\nwith recent legislation requirements for websites to obtain explicit\r\nconsent from users before leaving behind or reading files such as\r\ncookies on a user's computer / device.\r\n\r\nCookies are small files saved to the user's computers hard drive that\r\ntrack, save and store information about the user's interactions and\r\nusage of the website. This allows the website, through its server to\r\nprovide the users with a tailored experience within this website.\r\n\r\nUsers are advised that if they wish to deny the use and saving of\r\ncookies from this website on to their computers hard drive they should\r\ntake necessary steps within their web browsers security settings to\r\nblock all cookies from this website and its external serving vendors.\r\n\r\nThis website uses tracking software to monitor its visitors to better\r\nunderstand how they use it. This software is provided by Google\r\nAnalytics which uses cookies to track visitor usage. The software will\r\nsave a cookie to your computers hard drive in order to track and monitor\r\nyour engagement and usage of the website, but will not store, save or\r\ncollect personal information. You can read Google's privacy policy here\r\nfor further information\r\n[http://www.google.com/privacy.html](http://www.google.com/privacy.html).\r\n\r\nOther cookies may be stored to your computers hard drive by external\r\nvendors when this website uses referral programs, sponsored links or\r\nadverts. Such cookies are used for conversion and referral tracking and\r\ntypically expire after 30 days, though some may take longer. No personal\r\ninformation is stored, saved or collected.\r\n\r\n### Contact & Communication\r\n\r\nUsers contacting this website and/or its owners do so at their own\r\ndiscretion and provide any such personal details requested at their own\r\nrisk. Your personal information is kept private and stored securely\r\nuntil a time it is no longer required or has no use, as detailed in the\r\nData Protection Act 1998. Every effort has been made to ensure a safe\r\nand secure form to email submission process but advise users using such\r\nform to email processes that they do so at their own risk.\r\n\r\nThis website and its owners use any information submitted to provide you\r\nwith further information about the products / services they offer or to\r\nassist you in answering any questions or queries you may have submitted.\r\nThis includes using your details to subscribe you to any email\r\nnewsletter program the website operates but only if this was made clear\r\nto you and your express permission was granted when submitting any form\r\nto email process. Or whereby you the consumer have previously purchased\r\nfrom or enquired about purchasing from the company a product or service\r\nthat the email newsletter relates to. This is by no means an entire list\r\nof your user rights in regard to receiving email marketing material.\r\nYour details are not passed on to any third parties.\r\n\r\n### Email Newsletter\r\n\r\nThis website operates an email newsletter program, used to inform\r\nsubscribers about products and services supplied by this website. Users\r\ncan subscribe through an online automated process should they wish to do\r\nso but do so at their own discretion. Some subscriptions may be manually\r\nprocessed through prior written agreement with the user.\r\n\r\nSubscriptions are taken in compliance with UK Spam Laws detailed in the\r\nPrivacy and Electronic Communications Regulations 2003. All personal\r\ndetails relating to subscriptions are held securely and in accordance\r\nwith the Data Protection Act 1998. No personal details are passed on to\r\nthird parties nor shared with companies / people outside of the company\r\nthat operates this website. Under the Data Protection Act 1998 you may\r\nrequest a copy of personal information held about you by this website's\r\nemail newsletter program. A small fee will be payable. If you would like\r\na copy of the information held on you please write to the business\r\naddress at the bottom of this policy.\r\n\r\nEmail marketing campaigns published by this website or its owners may\r\ncontain tracking facilities within the actual email. Subscriber activity\r\nis tracked and stored in a database for future analysis and evaluation.\r\nSuch tracked activity may include; the opening of emails, forwarding of\r\nemails, the clicking of links within the email content, times, dates and\r\nfrequency of activity [this is by no means a comprehensive list].\r\n\r\nThis information is used to refine future email campaigns and supply the\r\nuser with more relevant content based around their activity.\r\n\r\nIn compliance with UK Spam Laws and the Privacy and Electronic\r\nCommunications Regulations 2003 subscribers are given the opportunity to\r\nun-subscribe at any time through an automated system. This process is\r\ndetailed at the footer of each email campaign. If an automated\r\nun-subscription system is unavailable clear instructions on how to\r\nun-subscribe will by detailed instead.\r\n\r\n### External Links\r\n\r\nAlthough this website only looks to include quality, safe and relevant\r\nexternal links, users are advised adopt a policy of caution before\r\nclicking any external web links mentioned throughout this website.\r\n(External links are clickable text / banner / image links to other\r\nwebsites, similar to; www.craftykingsboutique.co.uk or Kings Trains\r\nModels.)\r\n\r\nThe owners of this website cannot guarantee or verify the contents of\r\nany externally linked website despite their best efforts. Users should\r\ntherefore note they click on external links at their own risk and this\r\nwebsite and its owners cannot be held liable for any damages or\r\nimplications caused by visiting any external links mentioned.\r\n\r\n### Adverts and Sponsored Links\r\n\r\nThis website may contain sponsored links and adverts. These will\r\ntypically be served through our advertising partners, to whom may have\r\ndetailed privacy policies relating directly to the adverts they serve.\r\n\r\nClicking on any such adverts will send you to the advertisers website\r\nthrough a referral program which may use cookies and will track the\r\nnumber of referrals sent from this website. This may include the use of\r\ncookies which may in turn be saved on your computers hard drive. Users\r\nshould therefore note they click on sponsored external links at their\r\nown risk and this website and its owners cannot be held liable for any\r\ndamages or implications caused by visiting any external links mentioned.\r\n\r\n### Social Media Platforms\r\n\r\nCommunication, engagement and actions taken through external social\r\nmedia platforms that this website and its owners participate on are\r\ncustom to the terms and conditions as well as the privacy policies held\r\nwith each social media platform respectively.\r\n\r\nUsers are advised to use social media platforms wisely and communicate /\r\nengage upon them with due care and caution in regard to their own\r\nprivacy and personal details. This website nor its owners will ever ask\r\nfor personal or sensitive information through social media platforms and\r\nencourage users wishing to discuss sensitive details to contact them\r\nthrough primary communication channels such as by telephone or email.\r\n\r\nThis website may use social sharing buttons which help share web content\r\ndirectly from web pages to the social media platform in question. Users\r\nare advised before using such social sharing buttons that they do so at\r\ntheir own discretion and note that the social media platform may track\r\nand save your request to share a web page respectively through your\r\nsocial media platform account.\r\n\r\n### Shortened Links in Social Media\r\n\r\nThis website and its owners through their social media platform accounts\r\nmay share web links to relevant web pages. By default some social media\r\nplatforms shorten lengthy urls [web addresses] (this is an example:\r\n[http://bit.ly/zyVUBo](http://bit.ly/zyVUBo)).\r\n\r\nUsers are advised to take caution and good judgement before clicking any\r\nshortened urls published on social media platforms by this website and\r\nits owners. Despite the best efforts to ensure only genuine urls are\r\npublished many social media platforms are prone to spam and hacking and\r\ntherefore this website and its owners cannot be held liable for any\r\ndamages or implications caused by visiting any shortened links.\r\n\r\n#### Resources & Further Information\r\n\r\n-   Data Protection Act 1998\r\n-   Privacy and Electronic Communications\r\n-   Regulations 2003\r\n-   Privacy and Electronic Communications\r\n-   Regulations 2003 - The Guide\r\n-   Twitter Privacy Policy\r\n-   Facebook Privacy Policy\r\n-   Google Privacy Policy\r\n-   Linkedin Privacy Policy\r\n-   Mailchimp Privacy Policy\r\n-   Web Design Wales\r\n-   Website Privacy Policy Template\r\n\r\nv1.0. January 2016. Edited & customised by: Oh My Word!",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "created": "2017-07-23T13:03:10.813Z",
  "updated": "2017-07-23T13:04:35.516Z",
  "published": "",
  "contentType": "page",
  "id": "r1w5AfGL-"
}