{
  "title": "18 beautiful quotes about writing words ",
  "subtitle": "",
  "slug": "quotes-about-writing-words",
  "section": "words",
  "url": "/words/quotes-about-writing-words/",
  "body": "Terms. Expressions. Vocables. Vocabulary. Locutions. Idioms. Words. However you want to describe them, they're words and they're wonderful.\r\n\r\nWe write them, we think them and we say them aloud to ourselves and others. We use them every day to talk about anything from the weather to the way we feel.\r\n\r\nThey're a device like no other: when used perfectly, words have the power to move you like nothing else.\r\n\r\nGet inspired to put pen to paper and read these 18 beautiful quotes about writing and the power of words.\r\n\r\n##1. Confucius, Chinese teacher & philosopher\r\n> Without knowing the force of words, it is impossible to know more.\r\n##2. Lord Byron, poet\r\n> A drop of ink may make a million think.\r\n##3. Markus Zusak, in The Book Thief\r\n> I have hated words and I have loved them, and I hope I have made them right.\r\n##4. Ludwig Wittgenstein, philosopher\r\n> The limits of my language means the limits of my world.\r\n##5. Joseph Conrad, in Lord Jim\r\n> My task, which I am trying to achieve is, by the power of the written word, to make you hear, to make you feel--it is, before all, to make you see.\r\n##6. Sebastyne Young, author\r\n> A picture can tell a thousand words, but a few words can change it’s story.\r\n##7. E.L. Doctorow, in Homer & Langley\r\n> There is music in words, and it can be heard you know, by thinking.\r\n##8. Neil Gaiman, author\r\n> A short story is the ultimate close-up magic trick -- a couple of thousand words to take you around the universe or break your heart.\r\n##9. Robert Cormier, in I Am the Cheese\r\n> He was intrigued by the power of words, not the literary words that filled the books in the library but the sharp, staccato words that went into the writing of news stories. Words that went for the jugular. Active verbs that danced and raced on the page.\r\n##10. Sarah Smith, in Chasing Shakespeares\r\n> I believe God is a librarian. I believe that literature is holy...it is that best part of our souls that we break off and give each other, and God has a special dispensation for it, angels to guard its making and its preservation.\r\n#11. Ernest Hemingway, novelist\r\n> There is nothing to writing. All you do is sit down at a typewriter and bleed.\r\n##12. Anaïs Nin, author\r\n> We write to taste life twice, in the moment and in retrospect.\r\n##13. Saul Bellow, writer\r\n> You never have to change anything you got up in the middle of the night to write.\r\n##14. Ray Bradbury, in Zen in the Art of Writing\r\n> You must stay drunk on writing so reality cannot destroy you.”\r\n##15. Aldous Huxley, in Brave New World\r\n> Words can be like X-rays if you use them properly -- they’ll go through anything. You read and you’re pierced.\r\n##16. Sylvia Plath, in The Unabridged Journals of Sylvia Plath\r\n> Let me live, love, and say it well in good sentences.\r\n##17. C.S. Lewis, novelist & poet\r\n> You can make anything by writing.\r\n##18. Charles Baudelaire, poet\r\n> Always be a poet, even in prose.\r\n",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-14T11:54:18.948Z",
  "updated": "2017-08-14T11:54:25.167Z",
  "published": "2017-08-14T11:54:25.167Z",
  "contentType": "page",
  "id": "ry7d1My_b"
}