{
  "title": "Philes and phobias",
  "subtitle": "It's a love-hate thing",
  "slug": "philes-and-phobias",
  "section": "words",
  "url": "/words/philes-and-phobias/",
  "body": "Phobia: an extreme or irrational fear of or aversion to something.\r\nPhile: a combining form denoting a person or thing having a fondness for a specified thing.\r\n\r\nIf you're reading this, you're probably a logophile (lover of words), and you're not alone – we're with you on that one. But there are many more philes and phobias out there, some extremely odd. Here's a list of some of the strangest we could find:\r\n\r\n## Abibliophobia\r\nAn obsessive fear of being without books. Similarly, bibliophilia is the love of books.\r\n\r\n## Androphobia\r\nFear of men. You guessed it, androphilia is the love of men.\r\n\r\n## Amathophobia\r\nFear of dust.\r\n\r\n## Anglophobia\r\nFear of all things English. If that's you, you should probably leave now.\r\n\r\n## Autophilia\r\nLove of being alone.\r\n\r\n## Bufonophilia\r\nLove of toads. Really, though? Ew.\r\n\r\n## Cacophilia\r\nLove of ugliness. But surely, if you love the ugly, doesn't it become beautiful? Beauty, after all, is in the eye of the beholder.\r\n\r\n## Cometophobia\r\nFear of comets.\r\n\r\n## Deipnophobia\r\nFear of dining. (We absolutely cannot relate to that. We love dinner.)\r\n\r\n## Dextrophilia\r\nLove of all things to the right. Probably not Beyoncé fans, then...\r\n\r\n## Enissophilia\r\nLove of being criticised. All in the name of self improvement, we assume.\r\n\r\n## Gephyrophilia\r\nLove of crossing bridges. (Of course, gephyrophobia is the fear of such things.)\r\n\r\n## Genophobia\r\nFear of sex.\r\n\r\n## Hedonophobia\r\nFear of feeling pleasure. (Who are these people?!)\r\n\r\n## Homilophobia\r\nAnyone who grew up in a Church of England school will understand this: fear of sermons. Damn, they were boring.\r\n\r\n## Kyphophobia\r\nFear of stooping. Not ideal for tall people or miners.\r\n\r\n## Kopophilia\r\nLove of fatigue. Is this just an excuse to sleep more?\r\n\r\n## Lutraphilia\r\nLove of otters. Come on, who could say no to these?!\r\n\r\n## Merinthophilia\r\nLove of being tied up. Whatever you're into...\r\n\r\n## Metathesiophobia\r\nFear of change. Similarly, neophobia is fear of anything new.\r\n\r\n## Nudophobia\r\nFear of nudity.\r\n\r\n## Oneirogmophobia\r\nFear of wet dreams. Though, to be more gender-inclusive, we should also mention oneirophobia, which is a general fear of dreams.\r\n\r\n## Papaphilia\r\nLove of the Pope. Who doesn't love the Pope?!\r\n\r\n## Peladophilia\r\nLove of bald people.\r\n\r\n## Polyphobia\r\nFear of many things.\r\n\r\n## Socerophobia\r\nFear of your in-laws. Don't we all have this? Similarly, syngeneaphobia is the fear of relatives. Now there's a way to get out of those \r\nawkward family Christmas lunches.\r\n\r\n## Thassophilia\r\nLove of sitting. Any excuse for a comfy seat...\r\n\r\n## Tyrannophilia\r\nAn obsessive love of tyrants? Bizarre...\r\n\r\n## Xerophobia\r\nFear of dryness. Bring me the moisturiser!\r\n\r\n## Xenoglossophilia\r\nLove of foreign languages.\r\n\r\n_If you're a lover of the English language, you need [our Chrome extension](https://chrome.google.com/webstore/detail/oh-my-word/ehcalenbnkfmddlonpfaoacalanaiide) and [Android App](https://play.google.com/store/apps/details?id=xyz.ohmyword.app) so you can start logging your favourite words to your own personal dictionary._",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-16T08:48:48.288Z",
  "updated": "2017-08-16T08:49:08.249Z",
  "published": "2017-08-16T08:49:08.249Z",
  "contentType": "page",
  "id": "rydgvYbuZ"
}