{
  "title": "7 things you didn't know about Shakespeare ",
  "subtitle": "",
  "slug": "7-things-you-didnt-know-about-shakespeare",
  "section": "words",
  "url": "/words/7-things-you-didnt-know-about-shakespeare/",
  "body": "_This article was originally published on 23 April 2016._\r\n\r\nA name synonymous with English literature, William Shakespeare – AKA the Bard of Avon, greatest playwright of all time – had a birth (and death) day this weekend.\r\n\r\nIn celebration, we're rounding up 7 things you didn't know about this literary legend.\r\n\r\n## 1. He invented a few of our everyday phrases\r\nFrom good riddance to the be-all and end-all, Shakespeare is responsible for many of the phrases in our everyday language. Next time you say for goodness' sake, or wait with baited breath, you can thank the Bard for all his hard work – fair play (another one of his).\r\n\r\n## 2. He invented loads of words\r\nAs well as the above phrases, he made a whole new meanings for existing words by turning them on their grammatical head: nouns became adjectives or verbs, and vice versa.\r\nA few examples of this include accused, amazement, beached, caked, metamorphize, premeditated, swagger, zany.\r\n\r\n## 3. The word love appears just over 2000 times in his complete works\r\nAt 2191 times, the word and concept of love features heavily throughout Shakespeare's plays and poems.\r\nIncidentally he only uses the word sex 19 times.\r\n\r\n## 4. He used phrases from other languages\r\nNot satisfied with the idioms of the English language, and unable to invent them himself, Shakespeare also took phrases from other languages. He could read Latin, so it makes sense that 'fat paunches make lean pates' was originally a Greek and Latin proverb.\r\n\r\n## 5. His plays have been translated over 100 languages\r\nTo spread the good word(s) of Shakespeare, academics and writers all over the world have translated the Bard's plays and poems in over 100 languages.\r\nHamlet, for example, has been translated to Esperanto, Interlingua and Klingon.\r\n\r\n## 6. Macbeth is a deadly play\r\nThere's a reason actors won't say Macbeth, and instead refer to it as The Scottish Play or The Bard's Play. Over the 400 years since it was first performed, there have been numerous deaths among its actors on stage and off.\r\nIn the first ever performance (around 1606) the actor playing Lady Macbeth died suddenly beforehand and Shakespeare himself had to replace her. A performance in Amsterdam saw the actor playing King Duncan stabbed to death after the 'fake' knife used in the performance was actually real, and in 1849, the fans of two rival actors in a New York performance became violent and riots broke out, killing 22 and leaving 100 injured.\r\n\r\nSo next time you get tickets for the theatre, beware of Macbeth.\r\n\r\n## 7. He's in our stars – kind of\r\nIn 1851 astronomer William Lassell began naming stars and moons in our solar system after Shakespeare characters. There are moons named Puck, Titania, Oberon, Prospero, Ariel, and Caliban – but not a single one is named after Shakespeare himself.\r\n\r\n_If you're a lover of the English language, you need [our Chrome extension](https://chrome.google.com/webstore/detail/oh-my-word/ehcalenbnkfmddlonpfaoacalanaiide) and [Android App](https://play.google.com/store/apps/details?id=xyz.ohmyword.app) so you can start logging your favourite words to your own personal dictionary._",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-16T08:43:21.076Z",
  "updated": "",
  "published": "",
  "contentType": "page",
  "id": "ryW3HtWdW"
}