{
  "title": "7 reasons you need to download Oh My Word!",
  "subtitle": "",
  "slug": "reasons-to-download-oh-my-word",
  "section": "blog",
  "url": "/blog/reasons-to-download-oh-my-word/",
  "body": "We don't mean to be arrogant, but we think you need to download our Google Chrome extension.\r\nOh My Word! allows you to save beautiful words you find online to your own personal dictionary.\r\nNot sure why you'd use it? Here are a few reasons to download Oh My Word!:\r\n\r\n## 1. If you have a secret love for words\r\nWe all use them, every day. Some of us more than others, some of us in many different languages. You know a good word when you see one, so why wouldn't you want to save the best words you find online to your own personal dictionary?\r\nOh, you do? Then download the Chrome extension here.\r\n\r\n## 2. If you want to expand your vocabulary\r\nThere's nothing worse than seeing a word you like, making a mental note and then forgetting it two hours later. It happens to the best of us, don't worry. But now there's a way to combat this! Download Oh My Word! and you'll never need to remember new terms again – they'll all be saved in your own personal dictionary.\r\n\r\n## 3. If you're a word nerd\r\nOut and proud! That's what you are. So why not download Oh My Word! to save all those beautiful words you love, then shout about it to your friends. If you subscribe to our mailing list, we can update you with news and let you know when Oh My Word! is available for your mobile device.\r\n\r\n## 4. If you're learning English as a foreign language\r\nWe like to think this app could help anyone learning English as a foreign language build their vocabulary with interesting and beautiful English words. Download the Chrome extension and have a go!\r\n\r\n## 5. If you're a teacher\r\nFrom English teachers to journalism lecturers, we like to think this app can help you and your students. Soon you'll be able to collaborate on dictionaries, make them private or public, and have multiple dictionaries with different themes (scientific, mathematical or even musical). Subscribe to our mailing list to be notified when these handy features become available.\r\n\r\n## 6. If you're a student\r\nYou've got 3000 words to write in just two weeks and you're not even sure if you know that many words. Not only does Oh My Word! provide a great source of writing inspiration, but the Chrome extension allows you to keep a log of great words you might like to use in your academic writing. Whether it's for an essay or an entire dissertation, this app will help vary your language and keep you writing eloquently.\r\n\r\n## 7. If you're a writer\r\nIf writing, like us, is your profession, you'll understand why Oh My Word! is so brilliant. Save yourself from penning the same old turns of phrase and download the Oh My Word! Chrome extension to start logging new words as you discover them online.",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-14T12:04:11.045Z",
  "updated": "",
  "published": "",
  "contentType": "page",
  "id": "ryXaZfku-"
}