{
  "title": "11 lovely lost words from the English language",
  "subtitle": "",
  "slug": "lost-words-from-the-english-language",
  "section": "words",
  "url": "/words/lost-words-from-the-english-language/",
  "body": "Languages are evolving every day. Just as [new words are being added](https://ohmyword.xyz/inspiration/best-new-words-oxford-english-dictionary-2015/) to the English dictionary, older ones are becoming obsolete.\r\n\r\nThere are thousands of dead and buried words we've never heard of – some die because they're too specific, others because they're unfashionable, and some because we just don't need them anymore.\r\n\r\nBelow are a selection of words taken from Mark Forsyth's [_The Horologicon_](https://www.amazon.com/Horologicon-Jaunt-Through-English-Language/dp/0425264378), 'a day's jaunt through the lost words of the English Language.'\r\n\r\nAs Forsyth so eloquently puts it:\r\n\r\n> These are words too beautiful to live long, too amusing to be taken seriously, too precise to become common, too vulgar to survive in polite society, or too poetic to thrive in this age of prose.\r\n\r\n## 1. Uhtceare\r\nHow this ever went out of fashion we don't know – it's something we're all unfortunately familiar with. Uhtceare is the word for 'lying awake before dawn and worrying'.\r\n\r\n## 2. Snollygoster\r\nIt's not the most sophisticated sounding word, granted, but this one should really be coming back in fashion soon. We're looking at you, Donald Trump. A snollygoster – according to the OED – is 'a shrewd, unprincipled person, especially a politician.'\r\nThis one has an interesting history, which can be seen in the [Google Ngram](https://books.google.com/ngrams) below. We assume there was a snollygoster epidemic during the mid-1940s and 50s.\r\n<iframe name=\"ngram_chart\" src=\"https://books.google.com/ngrams/interactive_chart?content=snollygoster&year_start=1800&year_end=2000&corpus=15&smoothing=3&share=&direct_url=t1%3B%2Csnollygoster%3B%2Cc0\" width=900 height=500 marginwidth=0 marginheight=0 hspace=0 vspace=0 frameborder=0 scrolling=no></iframe>\r\n\r\n## 3. Whet\r\nThough still used today, this word had an entirely different meaning in eighteenth century. While today we talk about whetting our appetites, back then they'd wash down breakfast with a whet; an early-morning glass of white wine. This is a word we're definitely bringing back.\r\n\r\n## 4. Whiffler\r\nIf you're a commuter, you'll appreciate this one... A whiffler, according to the OED, is an attendant 'armed with a javelin, battle-axe, sword or staff, and wearing a chain, employed to keep the way clear for a procession.\r\n\r\n## 5. Borborygmi\r\nAn excellent term for the gurgling sounds your hungry stomach makes – something which happens often if you're a famelicose person (someone who is always hungry).\r\n\r\n## 6. Latrinogram\r\nA nifty little word for rumours started in the toilet. Obviously...\r\n\r\n## 7. Coenaculous\r\nDerived from the Latin cenaculum, this word means 'supper-loving'. Because who doesn't love dinner?\r\n\r\n## 8. Quomodocunquize\r\nTo make money in any way you possibly can. As used so perfectly in this wonderful phrase by Sir Thomas Urquhart in 1652: \"Those quomodocunquizing clusterfists and rapacious varlets.\"\r\n\r\n## 9. Agatewards\r\nThis means to accompany someone part of the way home. If you're walking alone, you were said to be solivagant, and omnivagant meant you were wandering everywhere.\r\n\r\n## 10. Nullibiquitous\r\nThe exact opposite of ubiquitous – so, existing nowhere.\r\n\r\n## 11. Sprezzatura\r\nA brilliant word, this essentially means nonchalance. But more precisely, it refers to the effort you make to look like you're not making an effort. Ridiculous, but brilliant.\r\n\r\n_If you're a lover of the English language, you need [our Chrome extension](https://chrome.google.com/webstore/detail/oh-my-word/ehcalenbnkfmddlonpfaoacalanaiide) and [Android App](https://play.google.com/store/apps/details?id=xyz.ohmyword.app) so you can start logging your favourite words to your own personal dictionary._",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-15T10:31:46.981Z",
  "updated": "2017-08-15T10:50:01.440Z",
  "published": "",
  "contentType": "page",
  "id": "S1sc6reOZ"
}