{
  "title": "Muscles, mice and all things nice: ",
  "subtitle": "7 things we've learned from interesting etymology",
  "slug": "7-things-weve-learned-from-interesting-etymology",
  "section": "words",
  "url": "/words/7-things-weve-learned-from-interesting-etymology/",
  "body": "The origin of words isn't something most people think about, but it can tell you more than you'd expect about civilisation.\r\nHere are a few things we've learned about life and history thanks to some interesting etymology:\r\n\r\n## 1. Robots are essentially slaves\r\nThe term robot – which means \"a machine capable of carrying out a complex series of actions automatically, especially one programmable by a computer.\" – came about in 1920 and was coined in a K. Čapek play called Rossum's Universal Robots.\r\nIt comes from the Czech word robota, which means 'forced labour'. So there's no wonder those toasters revolted in Battlestar Galactica.\r\n\r\n## 2. Avocados and testicles have more in common than you think\r\nIt was the Aztecs that did this to us. They believed an avocado looked like nothing other than big green balls, so they named it the ahuakatl which is their word for testicle.\r\nThe Spanish arrived and misheard it as aguacate and, of course, the English morphed this into the avocado we know today. Now there's a fact to put you off your guacamole.\r\n\r\n## 3. Why magazine has two different meanings\r\nThe word magazine comes from the Arabic word for store house (_makhazn_; plural _makhazin_). This word travelled through Europe – it was _magazzino_ in Italian and _magasin_ in French – and landed in England as magazine, retaining its original meaning of storehouse. This was used in a military sense, hence the magazine in a gun.\r\nIt was then Edward Cave, in 1731, who coined it as a term for a paper or journal with his Gentleman's Magazine. As Mark Forsyth supposes in _The Etymologicon_, Cave may have been suggesting the publication would arm men with information, or perhaps he just saw it as a storehouse of useful and interesting things.\r\n\r\n## 4. Eavesdropping could get you fined\r\nBefore we had the plastic guttering that lines our houses today, all roofs came complete with eaves – an overhang that would protect the exterior walls and foundations from rain damage.\r\nThis area of the roof was known as the eavesdrop and provided good cover for anyone wanting to loiter under cover of darkness and surreptitiously listen to conversations.\r\nIn Anglo-Saxon England, you could be fined for hanging about under the eavesdrop for suspected spying.\r\n\r\n## 5. Quarantine has a marine background\r\nThe word quarantine comes from the Italian _quarantina_, which translates as 'forty'.\r\nThis was the number of days ships were kept in isolation before docking in a port to prevent the spread of disease on land.\r\n\r\n## 6. The word nice isn't as nice as you might think\r\nIn thirteenth-century France the word nice meant \"foolish, stupid, senseless\".\r\nSince then it's been through the works a bit: it's meant fussy, fastidious, dainty, delicate, precise, careful, agreeable, delightful kind and thoughtful.\r\nThen, in 1926, lexicographer Henry Watson Fowler dismissed it (rather sexistly) as:\r\n> \"too great a favorite with the ladies, who have charmed out of it all its individuality and converted it into a mere diffuser of vague and mild agreeableness.\"\r\n\r\nWhich is why today being nice doesn't really mean anything at all.\r\n\r\n## 7. Mice are small but muscular\r\nThe word muscle is derived from the Latin musculus which translates literally as 'little mouse'.\r\nMuscles are called so because people used to think their shape and movement looked like little mice under the skin.\r\n\r\n_If you're a lover of the English language, you need [our Chrome extension](https://chrome.google.com/webstore/detail/oh-my-word/ehcalenbnkfmddlonpfaoacalanaiide) and [Android App](https://play.google.com/store/apps/details?id=xyz.ohmyword.app) so you can start logging your favourite words to your own personal dictionary._\r\n",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-08-16T08:08:37.662Z",
  "updated": "",
  "published": "",
  "contentType": "page",
  "id": "SyAYTuZ_-"
}